In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":["Mak","Kim","john","Milind"],
    "marks":[89,92,78,90],
    "city":['Mumbai',"Pune","Goa","Nashik"]   
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks    city
0     Mak     89  Mumbai
1     Kim     92    Pune
2    john     78     Goa
3  Milind     90  Nashik

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv',index=False)

In [7]:
df.head(2)

  name  marks    city
0  Mak     89  Mumbai
1  Kim     92    Pune

In [8]:
df.tail(2)

     name  marks    city
2    john     78     Goa
3  Milind     90  Nashik

In [29]:
df.dtypes

name     object
marks     int64
city     object
dtype: object

In [9]:
df.describe()

           marks
count   4.000000
mean   87.250000
std     6.291529
min    78.000000
25%    86.250000
50%    89.500000
75%    90.500000
max    92.000000

In [10]:
minhaj=pd.read_csv('Minhaj.csv')

In [11]:
minhaj

   Unnamed: 0  Train  speed    city
0           0  12353     50  Mumbai
1           1  14273    192    Pune
2           2  23457     78     Goa
3           3   8724    170  Nashik

In [12]:
minhaj['speed']

0     50
1    192
2     78
3    170
Name: speed, dtype: int64

In [13]:
minhaj['speed'][0]=50

C:\Users\Asif\AppData\Local\Temp\ipykernel_25116\142620764.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  minhaj['speed'][0]=50

In [14]:
minhaj

   Unnamed: 0  Train  speed    city
0           0  12353     50  Mumbai
1           1  14273    192    Pune
2           2  23457     78     Goa
3           3   8724    170  Nashik

In [15]:
minhaj.to_csv('minhaj.csv')

In [16]:
minhaj.index=['first','second','third','fourth']

In [17]:
minhaj

        Unnamed: 0  Train  speed    city
first            0  12353     50  Mumbai
second           1  14273    192    Pune
third            2  23457     78     Goa
fourth           3   8724    170  Nashik

In [19]:
ser= pd.Series(np.random.rand(34))

In [20]:
ser

0     0.234891
1     0.864127
2     0.992953
3     0.616196
4     0.115234
5     0.368689
6     0.551158
7     0.505050
8     0.899817
9     0.567762
10    0.968971
11    0.403624
12    0.574236
13    0.565558
14    0.450037
15    0.939187
16    0.973108
17    0.267998
18    0.596781
19    0.824191
20    0.976607
21    0.503704
22    0.034130
23    0.305087
24    0.929261
25    0.136416
26    0.279462
27    0.039224
28    0.175093
29    0.821372
30    0.618697
31    0.911916
32    0.391040
33    0.249964
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [22]:
newdf=pd.DataFrame(np.random.rand(300,5),index=np.arange(300))

In [26]:
type(newdf)

pandas.core.frame.DataFrame

In [25]:
newdf.head()

          0         1         2         3         4
0  0.931404  0.049236  0.771506  0.896075  0.584983
1  0.733037  0.586321  0.718749  0.535188  0.405154
2  0.837440  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351

In [24]:
newdf

            0         1         2         3         4
0    0.931404  0.049236  0.771506  0.896075  0.584983
1    0.733037  0.586321  0.718749  0.535188  0.405154
2    0.837440  0.232915  0.990634  0.104803  0.770342
3    0.577862  0.259012  0.300555  0.222997  0.802717
4    0.331327  0.000575  0.964795  0.983288  0.324351
..        ...       ...       ...       ...       ...
295  0.071719  0.032279  0.989040  0.754111  0.307257
296  0.085577  0.085478  0.545543  0.428617  0.273185
297  0.158013  0.631469  0.499497  0.429681  0.598090
298  0.775652  0.472214  0.648221  0.695901  0.547342
299  0.480453  0.316504  0.940811  0.370529  0.014868

[300 rows x 5 columns]

In [27]:
newdf.describe()

                0           1           2           3           4
count  300.000000  300.000000  300.000000  300.000000  300.000000
mean     0.509568    0.496841    0.512498    0.519438    0.506885
std      0.295032    0.283395    0.291755    0.286237    0.281590
min      0.003628    0.000575    0.002954    0.000332    0.000759
25%      0.260364    0.258234    0.277835    0.278887    0.296073
50%      0.508300    0.504025    0.514933    0.514227    0.500232
75%      0.765432    0.743382    0.770890    0.779374    0.755395
max      0.999110    0.998538    0.994912    0.993354    0.997664

In [28]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
newdf[0][0]="Minhaj"

C:\Users\Asif\AppData\Local\Temp\ipykernel_25116\3522970860.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]="Minhaj"
C:\Users\Asif\AppData\Local\Temp\ipykernel_25116\3522970860.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Minhaj' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="Minhaj"

In [35]:
newdf[0][1]="Test"

In [36]:
newdf.head()

          0         1         2         3         4
0    Minhaj  0.049236  0.771506  0.896075  0.584983
1      Test  0.586321  0.718749  0.535188  0.405154
2   0.83744  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351

In [32]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [33]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       290, 291, 292, 293, 294, 295, 296, 297, 298, 299],
      dtype='int64', length=300)

In [34]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [43]:
newdf.to_numpy()

array([[0.3, 0.04923636218960359, 0.7715058301904895, 0.896074992468672,
        0.5849827748050518],
       [0.5, 0.5863206110838298, 0.7187488197098711, 0.535188004330706,
        0.4051535604743791],
       [0.8374396334419115, 0.23291499911111202, 0.990634377302433,
        0.10480265137139955, 0.7703422155934928],
       ...,
       [0.15801253527700831, 0.6314694788688893, 0.4994966527432414,
        0.4296808759934808, 0.5980901849485938],
       [0.7756516231937071, 0.4722139694521178, 0.6482214885301294,
        0.6959008189039338, 0.5473422496494026],
       [0.48045267338073305, 0.3165042482829501, 0.9408108441210499,
        0.3705285885063505, 0.014868059434393066]],
      shape=(300, 5), dtype=object)

In [39]:
newdf[0][0]=0.3

In [42]:
newdf[0][1]=0.5

In [44]:
newdf

            0         1         2         3         4
0         0.3  0.049236  0.771506  0.896075  0.584983
1         0.5  0.586321  0.718749  0.535188  0.405154
2     0.83744  0.232915  0.990634  0.104803  0.770342
3    0.577862  0.259012  0.300555  0.222997  0.802717
4    0.331327  0.000575  0.964795  0.983288  0.324351
..        ...       ...       ...       ...       ...
295  0.071719  0.032279  0.989040  0.754111  0.307257
296  0.085577  0.085478  0.545543  0.428617  0.273185
297  0.158013  0.631469  0.499497  0.429681  0.598090
298  0.775652  0.472214  0.648221  0.695901  0.547342
299  0.480453  0.316504  0.940811  0.370529  0.014868

[300 rows x 5 columns]

In [46]:
newdf.T    
#transpose column change into row

,0,1,2,3,4,5,6,7,8,9,...,290,291,292,293,294,295,296,297,298,299
0,0.3,0.5,0.83744,0.577862,0.331327,0.252348,0.591793,0.548152,0.781333,0.612859,...,0.10068,0.583321,0.085733,0.493948,0.771901,0.071719,0.085577,0.158013,0.775652,0.480453
1,0.049236,0.586321,0.232915,0.259012,0.000575,0.263409,0.049803,0.409428,0.857628,0.198767,...,0.715942,0.422465,0.610239,0.077162,0.071289,0.032279,0.085478,0.631469,0.472214,0.316504
2,0.771506,0.718749,0.990634,0.300555,0.964795,0.85888,0.032952,0.638921,0.600266,0.798947,...,0.092045,0.456047,0.799772,0.020811,0.523997,0.98904,0.545543,0.499497,0.648221,0.940811
3,0.896075,0.535188,0.104803,0.222997,0.983288,0.843095,0.892115,0.49985,0.472542,0.189275,...,0.479598,0.772821,0.647129,0.634513,0.875579,0.754111,0.428617,0.429681,0.695901,0.370529
4,0.584983,0.405154,0.770342,0.802717,0.324351,0.147914,0.24471,0.680699,0.478435,0.316362,...,0.653462,0.865014,0.526894,0.004611,0.162078,0.307257,0.273185,0.59809,0.547342,0.014868

In [47]:
newdf.head()

          0         1         2         3         4
0       0.3  0.049236  0.771506  0.896075  0.584983
1       0.5  0.586321  0.718749  0.535188  0.405154
2   0.83744  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351

In [52]:
newdf.sort_index(axis=0,ascending=False)  
#by default asc is true and axis 0 means index order axis 1 means column order

            0         1         2         3         4
299  0.480453  0.316504  0.940811  0.370529  0.014868
298  0.775652  0.472214  0.648221  0.695901  0.547342
297  0.158013  0.631469  0.499497  0.429681  0.598090
296  0.085577  0.085478  0.545543  0.428617  0.273185
295  0.071719  0.032279  0.989040  0.754111  0.307257
..        ...       ...       ...       ...       ...
4    0.331327  0.000575  0.964795  0.983288  0.324351
3    0.577862  0.259012  0.300555  0.222997  0.802717
2     0.83744  0.232915  0.990634  0.104803  0.770342
1         0.5  0.586321  0.718749  0.535188  0.405154
0         0.3  0.049236  0.771506  0.896075  0.584983

[300 rows x 5 columns]

In [53]:
newdf.sort_index(axis=1,ascending=False)

            4         3         2         1         0
0    0.584983  0.896075  0.771506  0.049236       0.3
1    0.405154  0.535188  0.718749  0.586321       0.5
2    0.770342  0.104803  0.990634  0.232915   0.83744
3    0.802717  0.222997  0.300555  0.259012  0.577862
4    0.324351  0.983288  0.964795  0.000575  0.331327
..        ...       ...       ...       ...       ...
295  0.307257  0.754111  0.989040  0.032279  0.071719
296  0.273185  0.428617  0.545543  0.085478  0.085577
297  0.598090  0.429681  0.499497  0.631469  0.158013
298  0.547342  0.695901  0.648221  0.472214  0.775652
299  0.014868  0.370529  0.940811  0.316504  0.480453

[300 rows x 5 columns]

In [54]:
newdf[0]

0           0.3
1           0.5
2       0.83744
3      0.577862
4      0.331327
         ...
295    0.071719
296    0.085577
297    0.158013
298    0.775652
299    0.480453
Name: 0, Length: 300, dtype: object

In [56]:
type(newdf[0])

pandas.core.series.Series

In [57]:
newdf2=newdf

In [59]:
newdf[0][0]=153274

In [62]:
newdf.head()

          0         1         2         3         4
0    153274  0.049236  0.771506  0.896075  0.584983
1       0.5  0.586321  0.718749  0.535188  0.405154
2   0.83744  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351

In [63]:
newdf2.head()

          0         1         2         3         4
0    153274  0.049236  0.771506  0.896075  0.584983
1       0.5  0.586321  0.718749  0.535188  0.405154
2   0.83744  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351

In [64]:
newdf2[0][1]=837

In [67]:
newdf2.head()

          0         1         2         3         4
0    153274  0.049236  0.771506  0.896075  0.584983
1       837  0.586321  0.718749  0.535188  0.405154
2   0.83744  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351

In [68]:
newdf.head()

          0         1         2         3         4
0    153274  0.049236  0.771506  0.896075  0.584983
1       837  0.586321  0.718749  0.535188  0.405154
2   0.83744  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351

In [69]:
newdf3=newdf.copy()

In [70]:
newdf3[0][0]=9864

C:\Users\Asif\AppData\Local\Temp\ipykernel_25116\3466803403.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf3[0][0]=9864
C:\Users\Asif\AppData\Local\Temp\ipykernel_25116\3466803403.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[0][0]=9864

In [73]:
newdf.head()

          0         1         2         3         4
0    153274  0.049236  0.771506  0.896075  0.584983
1       837  0.586321  0.718749  0.535188  0.405154
2   0.83744  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351

In [74]:
newdf3.head()

          0         1         2         3         4
0      9864  0.049236  0.771506  0.896075  0.584983
1       837  0.586321  0.718749  0.535188  0.405154
2   0.83744  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351

In [75]:
newdf.loc[0,0]=657

In [77]:
newdf.head(2)

     0         1         2         3         4
0  657  0.049236  0.771506  0.896075  0.584983
1  837  0.586321  0.718749  0.535188  0.405154

In [78]:
newdf.columns=list('ABCDE')

In [80]:
newdf.head()

          A         B         C         D         E
0       657  0.049236  0.771506  0.896075  0.584983
1       837  0.586321  0.718749  0.535188  0.405154
2   0.83744  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351

In [81]:
newdf.loc[0,'A']=6427

In [83]:
newdf.head(2)

      A         B         C         D         E
0  6427  0.049236  0.771506  0.896075  0.584983
1   837  0.586321  0.718749  0.535188  0.405154

In [84]:
newdf.loc[0,0]=9274

In [85]:
newdf.head()

          A         B         C         D         E       0
0      6427  0.049236  0.771506  0.896075  0.584983  9274.0
1       837  0.586321  0.718749  0.535188  0.405154     NaN
2   0.83744  0.232915  0.990634  0.104803  0.770342     NaN
3  0.577862  0.259012  0.300555  0.222997  0.802717     NaN
4  0.331327  0.000575  0.964795  0.983288  0.324351     NaN

In [92]:
newdf.drop(0,axis=1)

            A         B         C         D         E
0        6427  0.049236  0.771506  0.896075  0.584983
1         837  0.586321  0.718749  0.535188  0.405154
2     0.83744  0.232915  0.990634  0.104803  0.770342
3    0.577862  0.259012  0.300555  0.222997  0.802717
4    0.331327  0.000575  0.964795  0.983288  0.324351
..        ...       ...       ...       ...       ...
295  0.071719  0.032279  0.989040  0.754111  0.307257
296  0.085577  0.085478  0.545543  0.428617  0.273185
297  0.158013  0.631469  0.499497  0.429681  0.598090
298  0.775652  0.472214  0.648221  0.695901  0.547342
299  0.480453  0.316504  0.940811  0.370529  0.014868

[300 rows x 5 columns]

In [94]:
newdf=newdf.drop(0,axis=1)

In [95]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.718749  0.535188
2  0.990634  0.104803

In [96]:
newdf.loc[:,['C','D']]

            C         D
0    0.771506  0.896075
1    0.718749  0.535188
2    0.990634  0.104803
3    0.300555  0.222997
4    0.964795  0.983288
..        ...       ...
295  0.989040  0.754111
296  0.545543  0.428617
297  0.499497  0.429681
298  0.648221  0.695901
299  0.940811  0.370529

[300 rows x 2 columns]

In [97]:
newdf.loc[[1,2],:]

         A         B         C         D         E
1      837  0.586321  0.718749  0.535188  0.405154
2  0.83744  0.232915  0.990634  0.104803  0.770342

In [100]:
newdf.loc[(newdf['A']<0.3)]

            A         B         C         D         E
5    0.252348  0.263409  0.858880  0.843095  0.147914
11   0.067445  0.617638  0.603911  0.087507  0.345190
12   0.016029  0.242643  0.574515  0.635162  0.384534
17   0.088661  0.449579  0.720766  0.206615  0.554844
18   0.180221  0.384992  0.192258  0.346335  0.218603
..        ...       ...       ...       ...       ...
290   0.10068  0.715942  0.092045  0.479598  0.653462
292  0.085733  0.610239  0.799772  0.647129  0.526894
295  0.071719  0.032279  0.989040  0.754111  0.307257
296  0.085577  0.085478  0.545543  0.428617  0.273185
297  0.158013  0.631469  0.499497  0.429681  0.598090

[85 rows x 5 columns]

In [101]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.2)]

            A         B         C         D         E
5    0.252348  0.263409  0.858880  0.843095  0.147914
11   0.067445  0.617638  0.603911  0.087507  0.345190
12   0.016029  0.242643  0.574515  0.635162  0.384534
17   0.088661  0.449579  0.720766  0.206615  0.554844
19   0.239172  0.550950  0.963734  0.103904  0.191417
..        ...       ...       ...       ...       ...
284  0.078403  0.210299  0.554476  0.253018  0.174942
292  0.085733  0.610239  0.799772  0.647129  0.526894
295  0.071719  0.032279  0.989040  0.754111  0.307257
296  0.085577  0.085478  0.545543  0.428617  0.273185
297  0.158013  0.631469  0.499497  0.429681  0.598090

[73 rows x 5 columns]

In [102]:
newdf.iloc[0,4]

np.float64(0.5849827748050518)

In [103]:
newdf.head(3)

         A         B         C         D         E
0     6427  0.049236  0.771506  0.896075  0.584983
1      837  0.586321  0.718749  0.535188  0.405154
2  0.83744  0.232915  0.990634  0.104803  0.770342

In [104]:
newdf.iloc[[0,5],[1,2]]

          B         C
0  0.049236  0.771506
5  0.263409  0.858880

In [106]:
newdf.head()

          A         B         C         D         E
0      6427  0.049236  0.771506  0.896075  0.584983
1       837  0.586321  0.718749  0.535188  0.405154
2   0.83744  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351

In [107]:
newdf.drop([0])

            A         B         C         D         E
1         837  0.586321  0.718749  0.535188  0.405154
2     0.83744  0.232915  0.990634  0.104803  0.770342
3    0.577862  0.259012  0.300555  0.222997  0.802717
4    0.331327  0.000575  0.964795  0.983288  0.324351
5    0.252348  0.263409  0.858880  0.843095  0.147914
..        ...       ...       ...       ...       ...
295  0.071719  0.032279  0.989040  0.754111  0.307257
296  0.085577  0.085478  0.545543  0.428617  0.273185
297  0.158013  0.631469  0.499497  0.429681  0.598090
298  0.775652  0.472214  0.648221  0.695901  0.547342
299  0.480453  0.316504  0.940811  0.370529  0.014868

[299 rows x 5 columns]

In [109]:
newdf.drop(['A','C'],axis=1)
#newdf.drop(['A','C'],axis=1,inplace=True)  original hi modify hojayga isse

            B         D         E
0    0.049236  0.896075  0.584983
1    0.586321  0.535188  0.405154
2    0.232915  0.104803  0.770342
3    0.259012  0.222997  0.802717
4    0.000575  0.983288  0.324351
..        ...       ...       ...
295  0.032279  0.754111  0.307257
296  0.085478  0.428617  0.273185
297  0.631469  0.429681  0.598090
298  0.472214  0.695901  0.547342
299  0.316504  0.370529  0.014868

[300 rows x 3 columns]

In [110]:
newdf.drop([1,5],axis=0,inplace=True)

In [113]:
newdf.head()

          A         B         C         D         E
0      6427  0.049236  0.771506  0.896075  0.584983
2   0.83744  0.232915  0.990634  0.104803  0.770342
3  0.577862  0.259012  0.300555  0.222997  0.802717
4  0.331327  0.000575  0.964795  0.983288  0.324351
6  0.591793  0.049803  0.032952  0.892115  0.244710

In [117]:
newdf.reset_index(drop=True,inplace=True)

In [118]:
newdf.head()

          A         B         C         D         E
0      6427  0.049236  0.771506  0.896075  0.584983
1   0.83744  0.232915  0.990634  0.104803  0.770342
2  0.577862  0.259012  0.300555  0.222997  0.802717
3  0.331327  0.000575  0.964795  0.983288  0.324351
4  0.591793  0.049803  0.032952  0.892115  0.244710

In [120]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
293    False
294    False
295    False
296    False
297    False
Name: B, Length: 298, dtype: bool

In [121]:
newdf['B']=None

In [122]:
newdf

            A     B         C         D         E
0        6427  None  0.771506  0.896075  0.584983
1     0.83744  None  0.990634  0.104803  0.770342
2    0.577862  None  0.300555  0.222997  0.802717
3    0.331327  None  0.964795  0.983288  0.324351
4    0.591793  None  0.032952  0.892115  0.244710
..        ...   ...       ...       ...       ...
293  0.071719  None  0.989040  0.754111  0.307257
294  0.085577  None  0.545543  0.428617  0.273185
295  0.158013  None  0.499497  0.429681  0.598090
296  0.775652  None  0.648221  0.695901  0.547342
297  0.480453  None  0.940811  0.370529  0.014868

[298 rows x 5 columns]

In [123]:
newdf['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
293    True
294    True
295    True
296    True
297    True
Name: B, Length: 298, dtype: bool

In [124]:
newdf.loc[:,['B']]=63

In [125]:
newdf.head()

          A   B         C         D         E
0      6427  63  0.771506  0.896075  0.584983
1   0.83744  63  0.990634  0.104803  0.770342
2  0.577862  63  0.300555  0.222997  0.802717
3  0.331327  63  0.964795  0.983288  0.324351
4  0.591793  63  0.032952  0.892115  0.244710

In [126]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
293    False
294    False
295    False
296    False
297    False
Name: B, Length: 298, dtype: bool

In [130]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, np.nan, np.nan],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [131]:
df.head()

       name  toy       born
0    Alfred  NaN        NaT
1    Batman  NaN 1940-04-25
2  Catwoman  NaN        NaT

In [132]:
df.dropna(how='all',axis=1)

       name       born
0    Alfred        NaT
1    Batman 1940-04-25
2  Catwoman        NaT

In [133]:
df.head()

       name  toy       born
0    Alfred  NaN        NaT
1    Batman  NaN 1940-04-25
2  Catwoman  NaN        NaT

In [140]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'BatMan', 'doll'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [141]:
df.head()

     name     toy       born
0  Alfred     NaN        NaT
1  Batman  BatMan 1940-04-25
2  Alfred    doll        NaT

In [142]:
df.drop_duplicates(subset=['name'],keep='last')

     name     toy       born
1  Batman  BatMan 1940-04-25
2  Alfred    doll        NaT

In [145]:
df.shape   #row and column as output table structure

(3, 3)

In [146]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [148]:
df['toy'].value_counts(dropna=False)

toy
NaN       1
BatMan    1
doll      1
Name: count, dtype: int64

In [149]:
df['toy'].value_counts(dropna=True)

toy
BatMan    1
doll      1
Name: count, dtype: int64

In [151]:
df.notnull()

#jaha jaha pe null hai waha false displayn hoga

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [152]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [ ]:
# create a dataframe which only contains only integer with 3 rows and 2 columns and run below cmethod
df.describe()
df.mean()
df.count()
df.min()
df.max()
df.median()
df.std()
df.corr()

In [153]:
dict1={"Roll no":[35,28,32],"Rank":[3,1,2]}

In [155]:
df=pd.DataFrame(dict1)

In [156]:
df

   Roll no  Rank
0       35     3
1       28     1
2       32     2

In [157]:
df.describe()

         Roll no  Rank
count   3.000000   3.0
mean   31.666667   2.0
std     3.511885   1.0
min    28.000000   1.0
25%    30.000000   1.5
50%    32.000000   2.0
75%    33.500000   2.5
max    35.000000   3.0

In [158]:
df.count()

Roll no    3
Rank       3
dtype: int64

In [159]:
df.min()

Roll no    28
Rank        1
dtype: int64

In [160]:
df.max()

Roll no    35
Rank        3
dtype: int64

In [161]:
df.corr()

          Roll no      Rank
Roll no  1.000000  0.996616
Rank     0.996616  1.000000

In [162]:
df.std()

Roll no    3.511885
Rank       1.000000
dtype: float64

In [163]:
df.median()

Roll no    32.0
Rank        2.0
dtype: float64

In [171]:
data=pd.read_excel('Book.xlsx',sheet_name='Sheet1')

In [172]:
data

   Trains2  Speeds2  Citys2
0     5678      140  Mumbai
1     3456      120    Pune
2     9834      160     Goa

In [173]:
data.iloc[0,0]=34

In [174]:
data

   Trains2  Speeds2  Citys2
0       34      140  Mumbai
1     3456      120    Pune
2     9834      160     Goa

In [176]:
data.to_excel('Book.xlsx',sheet_name='Sheet1')

In [1]:
import numpy as np
import pandas as pd

data=np.array(['g','i','r','l'])
ser=pd.Series(data)

In [2]:
print(ser)

0    g
1    i
2    r
3    l
dtype: object

In [3]:
print(type(ser))

<class 'pandas.core.series.Series'>

In [4]:
import numpy as np
import pandas as pd

data=np.array(['g','i','r','l'])
ser=pd.Series(data,index=[11,12,13,14])

print(ser)

11    g
12    i
13    r
14    l
dtype: object

In [5]:
import pandas as pd

# Creating Empty DataFrame and Storing it in variable df
df = pd.DataFrame()

# Printing Empty DataFrame
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
# Import pandas library
import pandas as pd

# initialize list elements
data = [110,202,303,404,550,650]

# Create the pandas DataFrame with the column name provided explicitly
df = pd.DataFrame(data, columns=['Amounts'])

# print dataframe.
print(df)

   Amounts
0      110
1      202
2      303
3      404
4      550
5      650

In [8]:
import pandas as pd

# Define a dictionary containing students data
data = {'Name': ['Sneha', 'Shreya',
				'Sabhya', 'Riya'],
		'Age': [22, 18, 10, 19],
		'Stream': ['Computer', 'Commerce',
				'Arts', 'Mechanical'],
		'Percentage': [89, 93, 97, 73]}
df=pd.DataFrame(data,columns=['Name','Age','Stream','Percentage'])

print('Given data frame \n',df)

Given data frame
      Name  Age      Stream  Percentage
0   Sneha   22    Computer          89
1  Shreya   18    Commerce          93
2  Sabhya   10        Arts          97
3    Riya   19  Mechanical          73

In [14]:
for index,row in df.iterrows():
    print(index,row['Name'],row['Age'],row['Stream'],row['Percentage'])

0 Sneha 22 Computer 89
1 Shreya 18 Commerce 93
2 Sabhya 10 Arts 97
3 Riya 19 Mechanical 73

In [17]:
import pandas as pd

data = {'Name': ['Amit', 'Riya', 'Raj'], 'Age': [25, 28, 22]}
df = pd.DataFrame(data, index=['a', 'b', 'c'])
print(df)
print(df.loc['b', 'Age'])      # Access row with label 'b' and column 'Age'
print(df.loc['a':'c', ['Name']])  # Select multiple rows and a specific column

   Name  Age
a  Amit   25
b  Riya   28
c   Raj   22
28
   Name
a  Amit
b  Riya
c   Raj

In [19]:
print(df.iloc[1, 1])       # 1st row, 1st column (0-based index)
print(df.iloc[0:2, 0])     # Select first 2 rows, first column


#Use .loc[] when your data has meaningful row/column labels

#Use .iloc[] when you just want to access by numeric index

28
a    Amit
b    Riya
Name: Name, dtype: object